package homework2;

public class Homework2_3 {
    public static void main(String[] args) {
        /*
        Составьте программу, выводящую на экран квадраты чисел от 10 до 20
        включительно.
         */

        int n = 10;
        while (n <= 20) {
            System.out.println(n * n);
            n += 1;
        }
    }
}
